In [98]:
import numpy as np
import pandas as pd

# Creation of Pandas Series

In [99]:
pds = pd.Series(list("abcdef"),range(0,6,1))

In [100]:
pds

0    a
1    b
2    c
3    d
4    e
5    f
dtype: object

# accessing elements of Series

In [101]:
pds[0]

'a'

In [102]:
pds[4]

'e'

In [103]:
pds[5]

'f'

# creating pandas series

In [172]:
pds1=pd.Series(list("lmnopq"),range(0,6,1))
pds2=pd.Series(list("tuvwxy"),range(0,6,1))
pds3=pd.Series(["apple","orange","banana","grapes","melon","pineapple"],range(0,6,1))
pds4=pd.Series(["blue","red","green","violet","white","black"],range(0,6,1))
pds5=pd.Series(["ble","yth","imn","let","hite","lack"],range(0,6,1))
pds6=pd.Series(["lue","njm","gen","vio","hit","back"],range(0,6,1))

In [173]:
print("pds1:\n", pds1)

pds1:
 0    l
1    m
2    n
3    o
4    p
5    q
dtype: object

In [174]:
print("\npds2:\n", pds2)

pds2:
 0    t
1    u
2    v
3    w
4    x
5    y
dtype: object

In [175]:
print("\npds3:\n", pds3)

pds3:
 0        apple
1       orange
2       banana
3       grapes
4        melon
5    pineapple
dtype: object

In [176]:
print("\npds4:\n", pds4)

pds4:
 0      blue
1       red
2     green
3    violet
4     white
5     black
dtype: object

# + operation on series

In [177]:
pds+pds1

0    al
1    bm
2    cn
3    do
4    ep
5    fq
dtype: object

In [178]:
pds1+pds2

0    lt
1    mu
2    nv
3    ow
4    px
5    qy
dtype: object

In [179]:
pds3+pds4

0         appleblue
1         orangered
2       bananagreen
3      grapesviolet
4        melonwhite
5    pineappleblack
dtype: object

# Creation of DataFrame from python dictionary whihch includes Pandas series

In [198]:
df1 = {"one":pds,"two":pds1,"three":pds3,"four":pds4,"five":pds5,"six":pds6}
pd_df1 = pd.DataFrame(df1)

In [199]:
pd_df1

   one  two      three    four five   six
0    a    l      apple    blue    7   lue
1    b    m     orange     red    8   njm
2    c    n     banana   green    4   gen
3    d    o     grapes  violet    5   vio
4    e    p      melon   white    2   hit
5    f    q  pineapple   black    1  back
6  NaN  NaN        NaN     NaN    9   NaN
7  NaN  NaN        NaN     NaN    6   NaN

In [200]:
pds5=pd.Series(list("78452196"),range(0,8))

In [201]:
df2={"alpha":pds4,"beta":pds5}
pd_df2=pd.DataFrame(df2)

In [202]:
pd_df2

    alpha beta
0    blue    7
1     red    8
2   green    4
3  violet    5
4   white    2
5   black    1
6     NaN    9
7     NaN    6

# Accessing a particular column

In [203]:
pd_df2["alpha"]

0      blue
1       red
2     green
3    violet
4     white
5     black
6       NaN
7       NaN
Name: alpha, dtype: object

# Accessing a group of particular columns

In [204]:
pd_df1[["one","three","four"]]

   one      three    four
0    a      apple    blue
1    b     orange     red
2    c     banana   green
3    d     grapes  violet
4    e      melon   white
5    f  pineapple   black
6  NaN        NaN     NaN
7  NaN        NaN     NaN

# Accessing a particlar cell using index and column names

In [205]:
pd_df1.loc[0,"one"]

'a'

In [206]:
pd_df1.loc[5,"three"]

'pineapple'

In [207]:
pd_df1.loc[3,"two"]

'o'

In [208]:
pd_df1.loc[3,"four"]

'violet'

# Accessing a particlar cell using index and column id(numbers)

In [209]:
pd_df1[["one","two","three","four"]]

   one  two      three    four
0    a    l      apple    blue
1    b    m     orange     red
2    c    n     banana   green
3    d    o     grapes  violet
4    e    p      melon   white
5    f    q  pineapple   black
6  NaN  NaN        NaN     NaN
7  NaN  NaN        NaN     NaN

In [213]:
pd_df1.iloc[5,2]

'pineapple'

In [214]:
pd_df1.iloc[0,3]

'blue'

In [215]:
pd_df1.iloc[4,1]

'p'

In [226]:
pd_df1.iloc[0,0]

'a'

# Adding a new column to a dataframe

In [227]:
pd_df1["ten"]=pd.Series(range(10,70,10),range(0,6))

In [228]:
pd_df1

   one  two      three    four five   six   ten
0    a    l      apple    blue    7   lue  10.0
1    b    m     orange     red    8   njm  20.0
2    c    n     banana   green    4   gen  30.0
3    d    o     grapes  violet    5   vio  40.0
4    e    p      melon   white    2   hit  50.0
5    f    q  pineapple   black    1  back  60.0
6  NaN  NaN        NaN     NaN    9   NaN   NaN
7  NaN  NaN        NaN     NaN    6   NaN   NaN

In [229]:
pd_df1_1 = pd_df1

# Removing a particular column

In [230]:

pd_df1_1.drop("four",axis=1)

   one  two      three five   six   ten
0    a    l      apple    7   lue  10.0
1    b    m     orange    8   njm  20.0
2    c    n     banana    4   gen  30.0
3    d    o     grapes    5   vio  40.0
4    e    p      melon    2   hit  50.0
5    f    q  pineapple    1  back  60.0
6  NaN  NaN        NaN    9   NaN   NaN
7  NaN  NaN        NaN    6   NaN   NaN

# Removing a particlular row

In [231]:
pd_df1_1.drop(6,axis=0)

   one  two      three    four five   six   ten
0    a    l      apple    blue    7   lue  10.0
1    b    m     orange     red    8   njm  20.0
2    c    n     banana   green    4   gen  30.0
3    d    o     grapes  violet    5   vio  40.0
4    e    p      melon   white    2   hit  50.0
5    f    q  pineapple   black    1  back  60.0
7  NaN  NaN        NaN     NaN    6   NaN   NaN

In [232]:
pd_df1_1.drop(7,axis=0)

   one  two      three    four five   six   ten
0    a    l      apple    blue    7   lue  10.0
1    b    m     orange     red    8   njm  20.0
2    c    n     banana   green    4   gen  30.0
3    d    o     grapes  violet    5   vio  40.0
4    e    p      melon   white    2   hit  50.0
5    f    q  pineapple   black    1  back  60.0
6  NaN  NaN        NaN     NaN    9   NaN   NaN

# making changes of column or row of dataframe using inplace

In [234]:
pd_df1_1.drop(6,axis=0,inplace=False)

   one  two      three    four five   six   ten
0    a    l      apple    blue    7   lue  10.0
1    b    m     orange     red    8   njm  20.0
2    c    n     banana   green    4   gen  30.0
3    d    o     grapes  violet    5   vio  40.0
4    e    p      melon   white    2   hit  50.0
5    f    q  pineapple   black    1  back  60.0
7  NaN  NaN        NaN     NaN    6   NaN   NaN

In [237]:
pd_df1_1.drop(7,axis=0,inplace=True)

In [238]:
pd_df1

  one two      three    four five   six   ten
0   a   l      apple    blue    7   lue  10.0
1   b   m     orange     red    8   njm  20.0
2   c   n     banana   green    4   gen  30.0
3   d   o     grapes  violet    5   vio  40.0
4   e   p      melon   white    2   hit  50.0
5   f   q  pineapple   black    1  back  60.0

# getting the dimension of a dataframe

In [239]:
pd_df1_1.shape

(6, 7)

# Slicing of a dataframe with columns name

In [240]:
pd_df1.loc[:,"one":"three"]

  one two      three
0   a   l      apple
1   b   m     orange
2   c   n     banana
3   d   o     grapes
4   e   p      melon
5   f   q  pineapple

In [241]:
pd_df1.loc[:, "two":"four"]

  two      three    four
0   l      apple    blue
1   m     orange     red
2   n     banana   green
3   o     grapes  violet
4   p      melon   white
5   q  pineapple   black

In [242]:
pd_df1.iloc[:, :3]

  one two      three
0   a   l      apple
1   b   m     orange
2   c   n     banana
3   d   o     grapes
4   e   p      melon
5   f   q  pineapple

# Selecting a subset of rows and columns:

In [243]:
pd_df1.loc[:1, ["one", "three", "ten"]]

  one   three   ten
0   a   apple  10.0
1   b  orange  20.0

# Slicing of a dataframe with rows & columns names

In [244]:
pd_df1.loc[2:5,"one":"three"]

  one two      three
2   c   n     banana
3   d   o     grapes
4   e   p      melon
5   f   q  pineapple

In [245]:
pd_df1.loc[0:4,"one":"ten"]

  one two   three    four five  six   ten
0   a   l   apple    blue    7  lue  10.0
1   b   m  orange     red    8  njm  20.0
2   c   n  banana   green    4  gen  30.0
3   d   o  grapes  violet    5  vio  40.0
4   e   p   melon   white    2  hit  50.0

In [246]:
pd_df1.loc[4:5,"one":"three"]

  one two      three
4   e   p      melon
5   f   q  pineapple

# Accessing a dataframe based on condition of column or row values

In [247]:
pd_df1[pd_df1["ten"]>30]

  one two      three    four five   six   ten
3   d   o     grapes  violet    5   vio  40.0
4   e   p      melon   white    2   hit  50.0
5   f   q  pineapple   black    1  back  60.0

In [249]:
pd_df1[pd_df1["ten"]>60]

Empty DataFrame
Columns: [one, two, three, four, five, six, ten]
Index: []

In [251]:
pd_df1[pd_df1["ten"]<60]

  one two   three    four five  six   ten
0   a   l   apple    blue    7  lue  10.0
1   b   m  orange     red    8  njm  20.0
2   c   n  banana   green    4  gen  30.0
3   d   o  grapes  violet    5  vio  40.0
4   e   p   melon   white    2  hit  50.0

Accessing a dataframe columns based on condition of column or row values

In [248]:
pd_df1[pd_df1["ten"]>30][["four","two"]]

     four two
3  violet   o
4   white   p
5   black   q

In [253]:
pd_df1[pd_df1["ten"]<30][["four","two","one","two","five","six"]]

   four two one two five  six
0  blue   l   a   l    7  lue
1   red   m   b   m    8  njm

In [254]:
pd_df2_1 = pd_df2_2 = pd_df2

In [255]:
pd_df2_1

    alpha beta
0    blue    7
1     red    8
2   green    4
3  violet    5
4   white    2
5   black    1
6     NaN    9
7     NaN    6

Dropping rows which are having nulls

In [256]:
pd_df2_1.dropna()

    alpha beta
0    blue    7
1     red    8
2   green    4
3  violet    5
4   white    2
5   black    1

Filling with specified values to a nulls

In [261]:
pd_df2_2.fillna("ash")

    alpha beta
0    blue    7
1     red    8
2   green    4
3  violet    5
4   white    2
5   black    1
6     ash    9
7     ash    6

In [270]:
pds6=pd.Series(["apple","orange","banana","apple","orange","pineapple"],range(0,6,1))
pds7=pd.Series(range(100,700,100),range(0,6,1))
df4={"qwerty":pds6,"asdf":pds7}
pd_df4=pd.DataFrame(df4)

In [271]:
pd_df4

      qwerty  asdf
0      apple   100
1     orange   200
2     banana   300
3      apple   400
4     orange   500
5  pineapple   600

Grouping based on column values and applying a relationship on other columns

In [272]:
pd_df4.groupby("qwerty").mean()

            asdf
qwerty
apple      250.0
banana     300.0
orange     350.0
pineapple  600.0

describing characterstics of column with numerical data

In [273]:
pd_df4["asdf"].describe()

count      6.000000
mean     350.000000
std      187.082869
min      100.000000
25%      225.000000
50%      350.000000
75%      475.000000
max      600.000000
Name: asdf, dtype: float64

Desribing charaterstics of column with categorical data

In [274]:
pd_df4["qwerty"].describe()

count         6
unique        4
top       apple
freq          2
Name: qwerty, dtype: object

# Dataframe concatenation

In [275]:
pds1=pd.Series(['a0','a1','a2'],range(3))
pds2=pd.Series(['b0','b1','b2'],range(2,5))
pds3=pd.Series(['a3','a4','a5'],range(3))
pds4=pd.Series(['b3','b4','b5'],range(2,5))

In [276]:
pda1=pd.DataFrame({'A1':pds1,'A2':pds3})

In [277]:
pdb1=pd.DataFrame({'B1':pds2,'B2':pds4})

In [278]:
pda1

   A1  A2
0  a0  a3
1  a1  a4
2  a2  a5

In [279]:
pdb1

   B1  B2
2  b0  b3
3  b1  b4
4  b2  b5

In [280]:
pd.concat([pda1,pdb1],axis=1)

    A1   A2   B1   B2
0   a0   a3  NaN  NaN
1   a1   a4  NaN  NaN
2   a2   a5   b0   b3
3  NaN  NaN   b1   b4
4  NaN  NaN   b2   b5

In [281]:
pd.concat([pda1,pdb1],axis=0)

    A1   A2   B1   B2
0   a0   a3  NaN  NaN
1   a1   a4  NaN  NaN
2   a2   a5  NaN  NaN
2  NaN  NaN   b0   b3
3  NaN  NaN   b1   b4
4  NaN  NaN   b2   b5

Dataframe join(it is basically on rows/indexes)

In [282]:
pda1.join(pdb1,how='inner')# this means only the rows with matching indexes in both dfs

   A1  A2  B1  B2
2  a2  a5  b0  b3

In [284]:
# Outer Join: It combines all rows from both DataFrames.
#  If a row exists in one DataFrame but not in the other 
# the missing values will be filled with NaN.
pda1.join(pdb1,how='outer')

    A1   A2   B1   B2
0   a0   a3  NaN  NaN
1   a1   a4  NaN  NaN
2   a2   a5   b0   b3
3  NaN  NaN   b1   b4
4  NaN  NaN   b2   b5

In [167]:
pda1.join(pdb1,how='left')

   A1  A2   B1   B2
0  a0  a3  NaN  NaN
1  a1  a4  NaN  NaN
2  a2  a5   b0   b3

In [168]:
pda1.join(pdb1,how='right')

    A1   A2  B1  B2
2   a2   a5  b0  b3
3  NaN  NaN  b1  b4
4  NaN  NaN  b2  b5

In [1]:
pip list

Package                                  Version
---------------------------------------- --------------
absl-py                                  2.1.0
aiohappyeyeballs                         2.4.3
aiohttp                                  3.10.10
aiosignal                                1.3.1
altair                                   5.4.1
annotated-types                          0.7.0
anyio                                    4.6.2.post1
argon2-cffi                              23.1.0
argon2-cffi-bindings                     21.2.0
arrow                                    1.3.0
asgiref                                  3.8.1
asttokens                                2.4.1
astunparse                               1.6.3
async-lru                                2.0.4
attrs                                    24.2.0
babel                                    2.16.0
backoff                                  2.2.1
bcrypt                                   4.2.0
beautifulsoup4                           4.12.3
bleach                                   6.2.0
blinker                                  1.9.0
blis                                     1.0.1
build                                    1.2.2.post1
cachetools                               5.5.0
catalogue                                2.0.10
certifi                                  2024.8.30
cffi                                     1.17.1
charset-normalizer                       3.4.0
chroma-hnswlib                           0.7.6
chromadb                                 0.5.18
click                                    8.1.7
cloudpathlib                             0.20.0
colorama                                 0.4.6
coloredlogs                              15.0.1
comm                                     0.2.2
community                                1.0.0b1
confection                               0.1.5
constants                                0.6.0
contourpy                                1.3.1
cycler                                   0.12.1
cymem                                    2.0.10
dataclasses-json                         0.6.7
debugpy                                  1.8.8
decorator                                5.1.1
defusedxml                               0.7.1
Deprecated                               1.2.14
dirtyjson                                1.0.8
distro                                   1.9.0
durationpy                               0.9
emoji                                    2.14.0
en_core_web_sm                           3.8.0
executing                                2.1.0
faiss-cpu                                1.9.0.post1
fastapi                                  0.115.5
fastjsonschema                           2.20.0
filelock                                 3.16.1
filetype                                 1.2.0
Flask                                    3.1.0
flatbuffers                              24.3.25
fonttools                                4.55.3
fqdn                                     1.5.1
frozenlist                               1.5.0
fsspec                                   2024.10.0
gast                                     0.6.0
gitdb                                    4.0.11
GitPython                                3.1.43
google-auth                              2.36.0
google-pasta                             0.2.0
googleapis-common-protos                 1.66.0
greenlet                                 3.1.1
grpcio                                   1.68.0
h11                                      0.14.0
h5py                                     3.12.1
httpcore                                 1.0.6
httptools                                0.6.4
httpx                                    0.27.2
httpx-sse                                0.4.0
huggingface-hub                          0.26.2
humanfriendly                            10.0
idna                                     3.10
importlib_metadata                       8.5.0
importlib_resources                      6.4.5
ipykernel                                6.29.5
ipython                                  8.29.0
ipywidgets                               8.1.5
isoduration                              20.11.0
itsdangerous                             2.2.0
jedi                                     0.19.2
Jinja2                                   3.1.4
jiter                                    0.7.0
joblib                                   1.4.2
json5                                    0.9.28
jsonpatch                                1.33
jsonpointer                              3.0.0
jsonschema                               4.23.0
jsonschema-specifications                2024.10.1
jupyter                                  1.1.1
jupyter_client                           8.6.3
jupyter-console                          6.6.3
jupyter_core                             5.7.2
jupyter-events                           0.10.0
jupyter-lsp                              2.2.5
jupyter_server                           2.14.2
jupyter_server_terminals                 0.5.3
jupyterlab                               4.2.6
jupyterlab_pygments                      0.3.0
jupyterlab_server                        2.27.3
jupyterlab_widgets                       3.0.13
keras                                    3.7.0
kiwisolver                               1.4.7
kubernetes                               31.0.0
langchain                                0.3.7
langchain-community                      0.3.7
langchain-core                           0.3.17
langchain-experimental                   0.3.3
langchain-openai                         0.2.8
langchain-text-splitters                 0.3.2
langcodes                                3.5.0
langsmith                                0.1.143
language_data                            1.3.0
libclang                                 18.1.1
llama-cloud                              0.1.4
llama-index                              0.11.22
llama-index-agent-openai                 0.3.4
llama-index-cli                          0.3.1
llama-index-core                         0.11.23
llama-index-embeddings-openai            0.2.5
llama-index-indices-managed-llama-cloud  0.4.0
llama-index-legacy                       0.9.48.post4
llama-index-llms-openai                  0.2.16
llama-index-multi-modal-llms-openai      0.2.3
llama-index-program-openai               0.2.0
llama-index-question-gen-openai          0.2.0
llama-index-readers-file                 0.2.2
llama-index-readers-llama-parse          0.3.0
llama-parse                              0.5.13
marisa-trie                              1.2.1
Markdown                                 3.7
markdown-it-py                           3.0.0
MarkupSafe                               3.0.2
marshmallow                              3.23.1
matplotlib                               3.9.3
matplotlib-inline                        0.1.7
mdurl                                    0.1.2
mistune                                  3.0.2
ml-dtypes                                0.4.1
mmh3                                     5.0.1
monotonic                                1.6
mpmath                                   1.3.0
multidict                                6.1.0
murmurhash                               1.0.11
mypy-extensions                          1.0.0
namex                                    0.0.8
narwhals                                 1.13.5
nbclient                                 0.10.0
nbconvert                                7.16.4
nbformat                                 5.10.4
nest-asyncio                             1.6.0
networkx                                 3.4.2
nltk                                     3.9.1
notebook                                 7.2.2
notebook_shim                            0.2.4
numpy                                    1.26.4
oauthlib                                 3.2.2
onnxruntime                              1.20.0
openai                                   0.28.0
opentelemetry-api                        1.28.2
opentelemetry-exporter-otlp-proto-common 1.28.2
opentelemetry-exporter-otlp-proto-grpc   1.28.2
opentelemetry-instrumentation            0.49b2
opentelemetry-instrumentation-asgi       0.49b2
opentelemetry-instrumentation-fastapi    0.49b2
opentelemetry-proto                      1.28.2
opentelemetry-sdk                        1.28.2
opentelemetry-semantic-conventions       0.49b2
opentelemetry-util-http                  0.49b2
opt_einsum                               3.4.0
optree                                   0.13.1
orjson                                   3.10.11
overrides                                7.7.0
packaging                                24.2
pandas                                   2.2.3
pandocfilters                            1.5.1
parso                                    0.8.4
pillow                                   11.0.0
pip                                      24.3.1
platformdirs                             4.3.6
posthog                                  3.7.0
preshed                                  3.0.9
prometheus_client                        0.21.0
prompt_toolkit                           3.0.48
propcache                                0.2.0
protobuf                                 5.28.3
psutil                                   6.1.0
pure_eval                                0.2.3
pyarrow                                  18.0.0
pyasn1                                   0.6.1
pyasn1_modules                           0.4.1
pycparser                                2.22
pydantic                                 2.9.2
pydantic_core                            2.23.4
pydantic-settings                        2.6.1
pydeck                                   0.9.1
Pygments                                 2.18.0
PyMySQL                                  1.1.1
pyparsing                                3.2.0
pypdf                                    4.3.1
PyPDF2                                   3.0.1
PyPika                                   0.48.9
pyproject_hooks                          1.2.0
pyreadline3                              3.5.4
python-dateutil                          2.9.0.post0
python-dotenv                            1.0.1
python-json-logger                       2.0.7
pytz                                     2024.2
pywin32                                  308
pywinpty                                 2.0.14
pywsd                                    1.2.5
PyYAML                                   6.0.2
pyzmq                                    26.2.0
referencing                              0.35.1
regex                                    2024.11.6
requests                                 2.32.3
requests-oauthlib                        2.0.0
requests-toolbelt                        1.0.0
rfc3339-validator                        0.1.4
rfc3986-validator                        0.1.1
rich                                     13.9.4
rouge_score                              0.1.2
rpds-py                                  0.21.0
rsa                                      4.9
safetensors                              0.4.5
scikit-learn                             1.5.2
scipy                                    1.14.1
seaborn                                  0.13.2
Send2Trash                               1.8.3
setuptools                               65.5.0
shellingham                              1.5.4
six                                      1.16.0
smart-open                               7.0.5
smmap                                    5.0.1
sniffio                                  1.3.1
soupsieve                                2.6
spacy                                    3.8.2
spacy-legacy                             3.0.12
spacy-loggers                            1.0.5
SQLAlchemy                               2.0.35
srsly                                    2.4.8
stack-data                               0.6.3
starlette                                0.41.3
streamlit                                1.40.1
striprtf                                 0.0.26
sympy                                    1.13.1
tenacity                                 8.5.0
tensorboard                              2.18.0
tensorboard-data-server                  0.7.2
tensorflow                               2.18.0
tensorflow_intel                         2.18.0
tensorflow-io-gcs-filesystem             0.31.0
termcolor                                2.5.0
terminado                                0.18.1
thinc                                    8.3.2
threadpoolctl                            3.5.0
tiktoken                                 0.8.0
tinycss2                                 1.4.0
tokenizers                               0.21.0
toml                                     0.10.2
torch                                    2.5.1
torchaudio                               2.5.1+cpu
torchvision                              0.20.1+cpu
tornado                                  6.4.1
tqdm                                     4.67.0
traitlets                                5.14.3
transformers                             4.47.0
typer                                    0.13.1
types-python-dateutil                    2.9.0.20241003
typing_extensions                        4.12.2
typing-inspect                           0.9.0
tzdata                                   2024.2
uri-template                             1.3.0
urllib3                                  2.2.3
uvicorn                                  0.32.0
wasabi                                   1.1.3
watchdog                                 6.0.0
watchfiles                               0.24.0
wcwidth                                  0.2.13
weasel                                   0.4.1
webcolors                                24.11.1
webencodings                             0.5.1
websocket-client                         1.8.0
websockets                               14.1
Werkzeug                                 3.1.3
wheel                                    0.45.1
widgetsnbextension                       4.0.13
wn                                       0.0.23
wrapt                                    1.16.0
xlrd                                     2.0.1
yarl                                     1.17.1
zipp                                     3.21.0
Note: you may need to restart the kernel to use updated packages.